Tekla.Structures.Model.Operations.Operation.ProgressBar
The ProgressBar class implements progress bar with cancel button.
The following example displays progress bar, updates progress, checks if cancel has been pressed
and closes the progress bar.
var progress = new Tekla.Structures.Model.Operations.Operation.ProgressBar();
bool displayResult = progress.Display(100, "title", "message", "cancel..", " ");
// looping ii from 0 to totalCount-1
{
if (ii % 20 == 0) // progress update every 20th item
{
if (progress.Canceled())
{
break;
}
progress.SetProgress(ii.ToString(), 100*ii/totalCount);
}
}
progress.Close();

Tekla.Structures.Model.Operations.Operation.ProgressBar.Display(System.Int32,System.String,System.String,System.String,System.String)
Display progress bar dialog with cancel button.
Display will fail if progress bar is already displayed.
SleepTime: Time (ms) to wait until bar is displayed.
Title: Title of the dialog.
Message: Message to be displayed on the dialog above progress bar.
CancelButtonLabel: Label of cancel button.
ProgressLabel: Initial progress label (updated with SetProgress). If empty of null no bar exists.
Returns: True if bar was displayed successfully (meaning bar must be closed later).

Tekla.Structures.Model.Operations.Operation.ProgressBar.Close
Close progress bar. Can be called even if Display was not successful.

Tekla.Structures.Model.Operations.Operation.ProgressBar.SetProgress(System.String,System.Int32)
Update status information on the progress bar.
ProgressLabel: Bar label text.
Progress: Progess, number between 0..100

Tekla.Structures.Model.Operations.Operation.ProgressBar.Canceled
Check if cancel has been pressed.
Returns: True if cancel has been pressed.